[
    {"name": "English 1", "head": "Jake Moffat", "description": "English 1 is designed to help students gain skills in thinking, writing, and speaking about literature. The course emphasizes both oral and written analysis of literature, and students will compose analytical papers, offer creative and reflective pieces, and engage in seminar discussions. Through a variety of literary forms (i.e., novels, short stories, poetry, and drama), students will consider the themes of coming of age, personal and social justice, and the individual’s roles and responsibilities in society. The course not only aims to build strong critical thinking and expressive skills but also encourages students to create supportive and collaborative spaces where students feel heard, respected, and empowered to use their voice."}, 
    {"name": "Modern World History", "head": "Ben Hunter or Michele Rench", "description": "Modern World History is the first year of a sequential Social Sciences Department curriculum and is designed to provide all entering Sacred Heart students with a common background in academic and social science skills, cultural concepts, historical appreciation, and essentials of geographic knowledge. Skills introduced and reinforced include summarizing and paraphrasing, categorization, understanding of historical perspective and bias, note taking and organization, presentation skills, introduction of research skills, and some persuasive writing. Students will write a research paper in the spring semester as well as work on collaborative and individual projects. Areas of study include Europe, Latin America, the Middle East, Asia and Africa. The geography component of the course teaches the importance of geography as a historical determinant and encourages environmental stewardship. Students will also participate actively and regularly in the SHP gardens."}, 
    {"name": "Biology", "head": "Diane Sweeney", "description": "Biology is a lab-based course for freshmen and sophomores designed to implement the Next Generation Science Standards. Throughout the year, students will build skills needed to design and create lab investigations based on biological concepts such as energy transformation, cell biology, and inherited traits. Other topics that are covered using the NGSS tools include evolution and natural selection, diversity of living organisms on Earth, and DNA/RNA structure and function. Lab skills will include proper use of lab equipment, data collection, organization, and analysis. Interactive notebooks will be required by each student."}, 
    {"name": "Biology Honors", "head": "Diane Sweeney", "description": "Biology Honors is designed for the highly motivated student with the ability to master in-depth biological concepts. The course covers a general biology curriculum with an emphasis on the microscopic environment. There is the expectation that the student will be able to visualize abstract biological concepts and investigate open-ended, inquiry-based lab experiments. Students interested in future Honors or AP science courses are encouraged to take this course. In addition to working with advanced lab equipment, students will have the opportunity to develop their own hypotheses and to design experiments to explore specific questions."}, 
    {"name": "Higher Placement", "description": "For higher placement, send a message to Diane Sweeney (dsweeney@shschools.org) with proof that you completed coursework equivalent or greater than the 9th grade Biology curriculum."}, 
    {"name": "Algebra", "head": "Jorge Reyes", "description": "This course is designed to develop skills leading to the analysis of problems which result in the solving of linear, quadratic, rational, and radical equations and systems of linear equations.  Students learn to use various problem-solving strategies in order to analyze these and other types of problems.  They explore the relationship between graphs and different types of equations analytically. An emphasis is placed on real-world problems that can be solved by writing and working an algebraic expression or equation."}, 
    {"name": "Geometry", "prerequisites": "Algebra 1 or satisfactory HSPT scores", "head": "Jorge Reyes", "description": "This course is designed to provide students with an understanding of geometric concepts that will prepare them for subsequent course work in mathematics, and allow them to be able to recognize geometric principles in the world around them. Students are introduced to the topics of plane, solid and analytic geometry, while continuing to use and extend some of the concepts learned in algebra. Students learn about angles, parallel lines, triangles and other types of polygons, congruence, similarity, circles, various types of solid figures, area and volume, coordinate geometry, and are introduced to right triangle trigonometry. Explorations on the iPad and hands-on projects may be used to help students discover and use many geometric concepts formalized in the text."}, 
    {"name": "Geometry Honors", "prerequisites": "satisfactory scores on the Geometry placement test", "head": "Jorge Reyes", "description": "This course is a more rigorous, fast-paced Geometry course designed for students with demonstrably strong Algebra 1 skills and inquisitive mathematical minds. Students are introduced to the topics of plane, solid and analytic geometry, while continuing to use and extend some of the concepts learned in algebra. Algebraic ideas are extended in this course through explorations with vectors and parametric equations. Students learn about angles, parallel lines, triangles and other types of polygons, congruence, similarity, transformations, circles, various types of solid figures, area and volume, coordinate geometry, and right triangle trigonometry. More emphasis is placed on constructing deductive justification for theorems and other assertions than in the regular Geometry course. Other possible topics include logic, the fourth dimension, and non-Euclidean geometries. Hands-on projects and explorations on the iPad may be used to help students discover and use many geometric concepts explored in the course and formalized in the text. Possible projects include construction of the Euler segment on the iPad, programming the TI calculator, and a geometric probability “carnival”."}, 
    {"name": "Algebra 2", "prerequisites": "Geometry or satisfactory scores on the Algebra 2 placement test", "head": "Jorge Reyes", "description": "This course is designed to extend and deepen students’ understanding of various previously learned algebraic concepts as well as introduce them to new algebra topics. Students study relations, functions and their graphs, linear equations and inequalities, quadratic and other polynomial functions, factoring, direct and inverse variation, powers and roots, exponential and logarithmic functions, complex numbers, rational functions, conics, and probability. Extensive use of the graphing calculator allows the emphasis to be on problem solving and exploration and analysis of real-world applications."}, 
    {"name": "Algebra 2 Trig Honors", "prerequisites": "exceptional performance in Geometry, satisfactory mastery of Geometry Honors, or exceptional scores on the Algebra 2 placement test", "head": "Jorge Reyes", "description": "This course is a more rigorous, fast-paced version of Algebra 2 that also includes a solid introduction to trigonometry. The topics covered in this course include those in the regular Algebra 2 course, but at a more challenging level. Students study relations, functions and their graphs, linear equations and inequalities, quadratic and other polynomial functions, direct and inverse variation, powers and roots, exponential and logarithmic functions, complex numbers, rational functions, conics, sequences and series. In addition, other topics covered include inverse functions, higher degree equations, and an extensive study of circular functions, trigonometry, and its applications. Extensive use of the graphing calculator allows the emphasis to be on problem solving and exploration and analysis of real-world applications."}, 
    {"name": "Higher Placement", "description": "For higher placement, send a message to Jorge Reyes (jreyes@shschools.org) with proof that you completed coursework equivalent or greater than the Algebra 2 curriculum"}, 
    {"name": "Introduction to Catholic Christianity", "head": "Virginia Boesen", "description": "This course is a comprehensive survey of Catholic doctrine.  Students will acquire a foundation and vocabulary for religious studies.  The following topics will be covered: Sacred Heart and traditions, identity and social development, faith, salvation, the nature and person of Jesus Christ, the nature and mission of the Catholic Church, the sacraments, prayer and spirituality, and ecumenical and interfaith concerns."}, 
    {"name": "Spanish 1", "description": "In this class, students will be introduced to the language of Spanish and the culture of the Spanish-speaking world. Students will learn how to describe the world around them, express their emotions, communicate basic situations, and gain a solid foundation for conversational and written Spanish. No prior experience is necessary."}, 
    {"name": "Spanish 2", "description": "A standard Spanish 2 curriculum"}, 
    {"name": "Spanish 2 Honors", "description": "A standard Spanish 2 curriculum designed to prepare students for Spanish 3 honors"}, 
    {"name": "Spanish 3", "description": "A standard Spanish 3 curriculum"}, 
    {"name": "Spanish 3 Honors", "description": "A standard Spanish 3 curriculum designed to prepare students for AP Spanish Language and Culture"}, 
    {"name": "Spanish For Heritage Speakers 1 Honors", "description": "A first formal Spanish course for heritage speakers of Spanish. Placement by departmental approval or satisfactory scores on the spanish heritage placement exam."}, 
    {"name": "Spanish For Heritage Speakers 2 Honors", "description": "This class is for heritage speakers well versed in conversational and compositional techniques in Spanish. Placement by departmental approval or exceptional scores on the spanish heritage placement exam."}, 
    {"name": "French 1", "description": "In this introductory French course, particular emphasis is placed on developing a sound basic vocabulary and on understanding the fundamentals of French grammar and structure. Students begin to develop the four skills of language learning: listening, speaking, reading, and writing. In addition, students are exposed to the French-speaking world and its culture. This course is mostly conducted in French."}, 
    {"name": "French 2", "description": "Conducted in French, this course develops and reinforces the skills learned in French 1. In addition to continuing to learn the fundamentals of grammar, the students expand their vocabulary base. They also continue to study the customs and traditions of the French-speaking world."}, 
    {"name": "French 2 Honors", "description": "In addition to completing the fundamentals and basic curriculum of French 2, this course requires the readings of selected short stories and poems. This class is only offered to those students who have demonstrated outstanding ability. This course is conducted in French."}, 
    {"name": "French 3", "description": "Conducted in French, this intermediate level course focuses on French culture through the study and discussion of literature, movies, and articles on the French character as well as through the exploration of the French-speaking world. This course also reinforces and refines the skills of reading, writing, speaking, and listening that are introduced in the first two years. Grammar is reviewed and introduced in context."}, 
    {"name": "French 3 Honors", "description": "Conducted in French, this intermediate level course is designed for students who have demonstrated outstanding communication and writing skills. Through the study and discussion of literary excerpts, films and articles, students learn about the French character, explore the French-speaking world, refine their language skills, and develop their understanding of grammatical concepts, which are introduced and reviewed in context."}, 
    {"name": "Mandarin 1", "description": "Mandarin 1 introduces students to the official Chinese language and to the cultures of Chinese/Mandarin-speaking countries and communities. It is designed for students who have no background or very limited knowledge of Mandarin. Basic speaking, listening, reading, and writing of Mandarin will be introduced and practiced."}, 
    {"name": "Mandarin 2", "description": "This course reinforces the skills learned in Mandarin 1 and continues to develop the four skills of reading, writing, speaking, and listening. In addition to continuing to learn the fundamentals of grammar, the students expand their vocabulary base. Writing and reading are emphasized more at this level. Students also continue to study the customs and traditions of the Mandarin-speaking world."}, 
    {"name": "Mandarin 3", "description": "This intermediate course is a review of the materials presented in Mandarin 1 and 2, with the introduction of Chinese poetry, cinema, and music. This course also presents more extensive writing and reading skills development through the readings and audio programs."}, 
    {"name": "Mandarin 3 Honors", "description": "This course is designed for students who have demonstrated outstanding communication and writing skills at level 2. Conducted entirely in Mandarin, it aims at expanding students’ vocabulary and word combination capacity to an advanced level, so as to make significant progress in listening, speaking, writing, and reading with new or familiar topics. Additionally, it further develops and deepens students’ knowledge of Chinese culture and introduces them to contemporary Chinese literature."}, 
    {"name": "Latin 1", "description": "In this introductory Latin class, students gain a foundation of Latin grammar, syntax, and vocabulary as they explore history, culture, and even mythology. Roots, derivations, and grammatical construction are emphasized. These studies also prepare students to higher master modern languages and give an excellent grounding in English grammar. Students develop analytical thinking as they translate from Latin to English and from English to Latin."}, 
    {"name": "Latin 2", "description": "At the intermediate level, students continue to study the language, its grammar, syntax, and vocabulary. There is increased awareness of the history and civilization of ancient Rome."}, 
    {"name": "Latin 2 Honors", "description": "In addition to completing the Latin 2 curriculum, this course stresses a more in-depth and intense study and understanding of the grammar through translating from English to Latin. Moreover, students will delve more into the history, culture, and mythology of the Classical world."}, 
    {"name": "Latin 3", "description": "Students complete the essentials of grammar and vocabulary through extensive reading in Latin. Grammar lessons continue while gradually incorporating authentic Latin."}, 
    {"name": "Latin 3 Honors", "description": "In addition to completing the Latin 3 curriculum, this course stresses a more in-depth and intense study and understanding of the grammar through translating from English to Latin. Moreover, students will delve more into the history, culture and mythology of the Classical world."}, 
    {"name": "Higher Placement", "description": "For higher placement, send a message to Minghui Anderson (manderson@shschools.org) with proof that you completed coursework equivalent or greater than the level 3 world language curriculum"}, 
    {"name": "Chorus", "head": "Lauren Benjamin", "description": "This course is designed for students who enjoy singing or are interested in learning more about singing in an upbeat, positive and stress-free environment.  No experience is necessary.  In this course, students will explore music from many historical periods and cultures through performance, listening activities and observation. While public performance is not the focus of this ensemble, students may perform for one another in the classroom and will perform as an ensemble at the winter and spring Fine Arts shows.  For those who want a break from the rigors of the regular school day, this is an excellent choice.  This course is a year-long UC-approved Fine Arts course that does fulfill that aspect of the SHP Fine Arts graduation requirement.  However, students who have already completed part or all of the SHP Fine Arts graduation requirement are also welcome.  This course may be repeated for credit as often as desired.  Students earn UC credit for this course; however, if this course is being taken to satisfy the year-long UC “F” requirement for Visual & Performing Arts, the full year-long course must be completed."}, 
    {"name": "Advanced Chorus", "head": "Lauren Benjamin", "description": "Advanced Chorus is the premiere group and requires an audition or consent from the instructor to join. The group tours nationally at least every other year. Past trips include Carnegie Hall in New York City, Los Angeles, and New Orleans. The Advanced Chorus has earned excellent and superior ratings at many choir competitions and festivals throughout the country. Performance commitments range from on-campus school liturgies/Espacios, singing for our RSCJ community at Oakwood, to annual Winter and Spring concerts. Students earn UC credit for this course; however, if this course is being taken to satisfy the year-long UC “F” requirement for Visual & Performing Arts, the full year-long course must be completed."}, 
    {"name": "Dance", "head": "Lauren Benjamin", "description": "This course is an introduction to contemporary Western styles of dance: jazz, musical theater, modern, and hip-hop. The focus of the class is basic development in rhythmic understanding/musicality, coordination, flexibility and strength, retention and artistic expression. Each class may include: a series of warm-up exercises to develop body placement and muscles; movements across the floor and applied technique through movement combinations and choreography. Students will learn as well as create their own choreography. Semester finals consist of participation in a school performance showcase in the fall and in the spring. Students earn UC credit for this course; however, if this course is being taken to satisfy the year-long UC “F” requirement for Visual & Performing Arts, the full year-long course must be completed. There are no prerequisites for this course."}, 
    {"name": "Intermediate/Advanced Dance", "head": "Lauren Benjamin", "description": "(All Styles) This year-long course is designed for intermediate to advanced level students. The course focuses on improving technical skills, strength and flexibility, learning and executing more complex movement sequence.  Student will explore traditional and contemporary dance forms. Students will also develop their capacity to reflect, analyze and interpret movement composition. Students will explore and develop skill in movement improvisation, choreography and artistic expression/conception. Each class may include: warm-up exercises; movement combinations across the floor; and choreography. Semester finals consist of participation in a school performance showcase in the fall and in the spring. Students earn UC credit for this course; however, if this course is being taken to satisfy the yearlong UC “F” requirement for Visual & Performing Arts, the full year-long course must be completed. Prerequisites for this course include Beginning or Intermediate Dance with teacher recommendation and/or placement audition."}, 
    {"name": "Drama", "head": "Lauren Benjamin", "description": "This course teaches the basic principles of acting technique and performance.  It explores script analysis, character development, improvisation, and the audition. Students will be given exercises involving scene objectives, inner monologues, voice and movement.  Class culminates in a rehearsed, self-produced ensemble piece. Students earn UC credit for this course; however, if this course is being taken to satisfy the year- ong UC ”F” requirement for Visual & Performing Arts, the full year-long course must be completed."}, 
    {"name": "Health and Wellness", "head": "Monika Nagy Andrade", "description": "Health & Wellness is a one semester requirement that is part of the school's overall commitment to providing students with ongoing opportunities to learn about health related topics and to reflect upon individual decision-making in the context of the SHP community and beyond. The emphasis of the program is to promote balance, safety, self-reflection, and the skills to navigate various situations and decisions that students may encounter throughout their teenage years. A major goal of the course is to build healthy communities where individuals look out for one another and feel empowered to make healthy decisions. Topics of the course include: Adolescent Development, Identity, Conformity & Bystander Effects, Physical Health, Mental Health, Relationships, Communication, Substance Use, Sexual Health, Technology & Social Media. Many students take this course in 9th grade, though advisors work creatively with students and families to fulfill this requirement in concert with the individualized interests of each student, in which case it can sometimes be fulfilled outside of the A-G schedule or during summer school.  Students earn UC credit for this course. "}, 
    {"name": "Computer Science Principles", "head": "Kevin Morris", "description": "What happens when you load a web page? Where is “the cloud”? What is a computer program? This one-semester course provides an introduction to some essential principles of computers and computer science. Topics include networking, web page design, hardware, computer graphics, programming and project management. While the course is not a full programming class, students will gain an understanding of programming using Javascript. Aware that we live in an increasingly “digital world,” the course will also explore themes such as privacy, security, social networking, the effects of technology on the brain, and ethical uses of technology. To exemplify 21st Century learning, the course will require students to manage a digital workflow through the exploration of a variety of digital tools, online organization and collaboration."}, 
    {"name": "Programming", "head": "Kevin Morris", "description": "This semester course provides an introduction to computer programming languages, including Python and Javascript. The course is appropriate for students who want to learn about how computer programs are written, as well as for students who might want to take AP Computer Science in the future. During the course, students create a variety of interesting programs that touch on topics solving problems involving graphics, animation, game design, and user interfaces. The course covers the basic building blocks of software development, such as control structures, object-oriented programming, and manipulating data."}, 
    {"name": "Higher Placement", "description": "For higher placement, send a message to Kevin Morris (kmorris@shschools.org) with proof that you completed coursework equivalent or greater than the programming curriculum"}
]